In [12]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'1.1.3'

In [4]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : db08276bc116c438d3fdee492026f8223584c477
python           : 3.8.5.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.16299
machine          : AMD64
processor        : Intel64 Family 6 Model 142 Stepping 11, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.1.3
numpy            : 1.19.2
pytz             : 2020.1
dateutil         : 2.8.1
pip              : 20.2.4
setuptools       : 50.3.1.post20201107
Cython           : 0.29.21
pytest           : 6.1.1
hypothesis       : None
sphinx           : 3.2.1
blosc            : None
feather          : None
xlsxwriter       : 1.3.7
lxml.etree       : 4.6.1
html5lib         : 1.1
pymysql          : None
psycopg2         : None
jinja2           : 2.11.2
IPython          : 7.19.0
pandas_datareader: None
bs4              : 4.9.3
bottleneck       : 1.3.2
fsspec           : 0.8.3
fastparquet      : None
gcsfs            : None
matplotlib       : 3.3.2
numexpr          : 2.7.1
odfpy            : None
openpyxl         : 3.0.5
pandas_gbq       : None
pyarrow          : None
pytables         : None
pyxlsb           : None
s3fs             : None
scipy            : 1.5.2
sqlalchemy       : 1.3.20
tables           : 3.6.1
tabulate         : None
xarray           : None
xlrd             : 1.2.0
xlwt             : 1.3.0
numba            : 0.51.2

In [15]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data , index=labels)
print(df)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [16]:
print("Summary of DataFrame and its data:")
print(df.info())

Summary of DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

In [17]:
print('The first 3 row')
print(df.iloc[:3])

The first 3 row
  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [18]:
df[['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [20]:
df.loc[df.index[[3,4,8]], ['animal','age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [22]:
df[df['visits'] >= 3]

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

In [23]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [26]:
df[(df['animal'] == 'cat') & (df['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [28]:
df[(df['age'].between(2,4))]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

In [29]:
df.loc['f', 'age'] = 7

In [30]:
df['visits'].sum()

19

In [33]:
df.groupby('animal')['age'].mean()

animal
cat      4.166667
dog      5.000000
snake    2.500000
Name: age, dtype: float64

In [41]:
df.loc['k'] = ['elephant', 4.0, 'no', 2]

In [42]:
df[['animal','age']]

     animal  age
a       cat  2.5
b       cat  3.0
c     snake  0.5
d       dog  NaN
e       dog  5.0
f       cat  7.0
g     snake  4.5
h       cat  NaN
i       dog  7.0
j       dog  3.0
k  elephant  4.0

In [39]:
df = df.drop('k')

In [43]:
df['animal'].value_counts()

dog         4
cat         4
snake       2
elephant    1
Name: animal, dtype: int64

In [44]:
df['age'].value_counts()

7.0    2
3.0    2
4.0    1
4.5    1
5.0    1
0.5    1
2.5    1
Name: age, dtype: int64

In [50]:
df.sort_values(by=['age', 'visits'], ascending=[False, False])

     animal  age visits priority
f       cat  7.0      3       no
i       dog  7.0      2       no
e       dog  5.0      2       no
g     snake  4.5      1       no
k  elephant  4.0     no        2
b       cat  3.0      3      yes
j       dog  3.0      1       no
a       cat  2.5      1      yes
c     snake  0.5      2       no
d       dog  NaN      3      yes
h       cat  NaN      1      yes

In [51]:
df['animal'] = df['animal'].replace('snake', 'phython')

In [52]:
print(df)

     animal  age visits priority
a       cat  2.5      1      yes
b       cat  3.0      3      yes
c   phython  0.5      2       no
d       dog  NaN      3      yes
e       dog  5.0      2       no
f       cat  7.0      3       no
g   phython  4.5      1       no
h       cat  NaN      1      yes
i       dog  7.0      2       no
j       dog  3.0      1       no
k  elephant  4.0     no        2

In [55]:
df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits      1    2    3   no
animal
cat       2.5  NaN  5.0  NaN
dog       3.0  6.0  NaN  NaN
elephant  NaN  NaN  NaN  4.0
phython   4.5  0.5  NaN  NaN

# Slightly harder problems

In [56]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

In [57]:
df.loc[df['A'].shift() != df['A']]

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [58]:
df = pd.DataFrame(np.random.random(size=(5, 3)))

In [59]:
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0  0.020838  0.082368 -0.103206
1 -0.415334  0.130793  0.284541
2 -0.077581  0.047033  0.030548
3 -0.083810 -0.332802  0.416612
4  0.129640 -0.320817  0.191177

In [61]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
print(df)
df.sum().idxmin()

          a         b         c         d         e         f         g  \
0  0.128544  0.607458  0.347100  0.684457  0.058481  0.135572  0.305641
1  0.192129  0.920938  0.612610  0.477433  0.232581  0.873263  0.877415
2  0.612144  0.748606  0.916847  0.248226  0.687740  0.624024  0.999774
3  0.783614  0.854392  0.393130  0.168964  0.747793  0.670578  0.603485
4  0.038898  0.219700  0.093791  0.543494  0.189803  0.350578  0.315329

          h         i         j
0  0.301822  0.129463  0.610066
1  0.691619  0.801577  0.632939
2  0.914371  0.903896  0.050881
3  0.443496  0.579446  0.630385
4  0.316622  0.141864  0.002208

'a'

In [65]:
len(df.drop_duplicates(keep=False))

5

In [66]:
(df.isnull().cumsum(axis=1) == 3).idxmax(axis=1)

0    a
1    a
2    a
3    a
4    a
dtype: object

In [68]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
df.groupby('grps').apply(lambda x: x.vals.nlargest(3).sum())

grps
a    409
b    156
c    345
dtype: int64